## Pandas III

In [2]:
import pandas as pd

In [3]:
titanic_dataset_github_url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(titanic_dataset_github_url)

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
### replacing a substring

In [6]:
df.loc[1, "Name"]

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

In [12]:
df["Name"].str.replace("Mr", "Sir", regex=False)

0                               Braund, Sir. Owen Harris
1      Cumings, Sirs. John Bradley (Florence Briggs T...
2                                 Heikkinen, Miss. Laina
3          Futrelle, Sirs. Jacques Heath (Lily May Peel)
4                              Allen, Sir. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                               Behr, Sir. Karl Howell
890                                 Dooley, Sir. Patrick
Name: Name, Length: 891, dtype: str

In [4]:
### find and remove the brackets

start = df.loc[1, "Name"].find("(")
end = df.loc[1, "Name"].find(")")

In [5]:
df.loc[1, "Name"][0:start] + df.loc[1, "Name"][end+1:]

'Cumings, Mrs. John Bradley '

In [8]:
def remove_brackets(name):
    start = name.find("(")
    end = name.find(")")
    new_name = name[0:start] + name[end+1:]
    new_name = new_name.strip()
    return new_name

In [9]:
df["Name_trimmed"] = df["Name"].apply(remove_brackets)
df["Name_trimmed"].head()

0      Braund, Mr. Owen HarriBraund, Mr. Owen Harris
1                         Cumings, Mrs. John Bradley
2        Heikkinen, Miss. LainHeikkinen, Miss. Laina
3                       Futrelle, Mrs. Jacques Heath
4    Allen, Mr. William HenrAllen, Mr. William Henry
Name: Name_trimmed, dtype: str

In [11]:
df.loc[1, "Name_trimmed"]

'Cumings, Mrs. John Bradley'

In [ ]:
#### replace Substring with Regex : regular expression

# *  means zero or more
# . match any character
# # r"\(.*\)"
# windows : \\

df["Name"].str.replace(r"\\(.*\\)", "Hello", regex=False).head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: str

In [ ]:
### create a regex pattern to check if an email is right or wrong

### split and access element

In [13]:
df["Name"].str.split(",")[0]

['Braund', ' Mr. Owen Harris']

In [14]:
df["Name"].str.split()[0]

['Braund,', 'Mr.', 'Owen', 'Harris']

#### strip or remove spaces

In [15]:
df["Name"].str.strip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: str

In [16]:
df["Name"].str.rstrip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: str

In [17]:
df["Name"].str.lstrip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: str

#### contains

In [18]:
df["Name"].str.contains("Mrs")

0      False
1       True
2      False
3       True
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Name, Length: 891, dtype: bool

In [30]:
count1 = df["Name"].str.contains("Miss").sum()
print("Number of Miss :", count1)

Number of Miss : 0

## Categorical Data in Pandas

In [31]:
class_data = {
"Name" : ["A","B","C","D"],
"Groups":["G1","G2","G3","G4"]

}

In [32]:
class_df = pd.DataFrame(class_data)
class_df

  Name Groups
0    A     G1
1    B     G2
2    C     G3
3    D     G4

In [33]:
class_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      str
 1   Groups  4 non-null      str
dtypes: str(2)
memory usage: 196.0 bytes

In [ ]:
class_df["Group_cat"] = pd.Categorical(
    class_df["Groups"],
    categories=["G3", "G1", "G2", "G4"], ## CUSTOM ORDER DONE LOWER TO HIGHER ascending order
    #["G3"= 1, "G1"=2, "G2"=3, "G4"= 4]
    ordered=True
)

In [35]:
class_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       4 non-null      str
 1   Groups     4 non-null      str
 2   Group_cat  4 non-null      category
dtypes: category(1), str(2)
memory usage: 404.0 bytes

In [36]:
class_df["Group_cat"].cat.categories

Index(['G3', 'G1', 'G2', 'G4'], dtype='str')

In [ ]:
class_df["Group_cat"] >= "G4"
#["G3"= 1, "G1"=2, "G2"=3, "G4"= 4]
# if g3 greater than g4 =false
# if g1 greater than g4 =false
# if g2 greater than g4 =false
# if g4 greater than g4 = true  based on the ordering

0    False
1    False
2    False
3     True
Name: Group_cat, dtype: bool

In [38]:
titanic_dataset_github_url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(titanic_dataset_github_url)

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [39]:
df["Embarked"].unique()

<StringArray>
['S', 'C', 'Q', nan]
Length: 4, dtype: str

In [40]:
df["Embarked"] = df["Embarked"].fillna("N")

In [41]:
df["Embarked"].unique()

<StringArray>
['S', 'C', 'Q', 'N']
Length: 4, dtype: str

In [42]:
df["Embarked_cat"] = df["Embarked"].astype("category")
df["Embarked_cat"].cat.categories

Index(['C', 'N', 'Q', 'S'], dtype='str')

In [ ]:
df["Embarked_cust_cat"] = pd.Categorical(
    df["Embarked"] ,
    categories=["N", "S", "C", "Q"], ## CUSTOM ORDER DONE LOWER TO HIGHER ascending order

    ordered=True
)

In [44]:
df["Embarked_cust_cat"].cat.categories

Index(['N', 'S', 'C', 'Q'], dtype='str')

In [45]:
df["Embarked_cust_cat"].head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked_cust_cat, dtype: category
Categories (4, str): ['N' < 'S' < 'C' < 'Q']

In [46]:
df["Embarked_cust_cat"].cat.codes.head()

0    1
1    2
2    1
3    1
4    1
dtype: int8

In [47]:
## df["Sex"] encode these column into zero and 1
df["Sex"].unique()

<StringArray>
['male', 'female']
Length: 2, dtype: str

In [48]:
df["Sex_new"] = df["Sex"].astype("category").cat.codes

In [49]:
df["Sex_new"].head()

0    1
1    0
2    0
3    0
4    1
Name: Sex_new, dtype: int8

In [51]:
df["Sex_new1"] = df["Sex"].apply(lambda sex: 1 if sex == "male" else 0)

In [52]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked_cat,Embarked_cust_cat,Sex_new,Sex_new1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,S,S,1,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C,C,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,S,S,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,S,S,0,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,S,S,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,S,S,1,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,S,S,0,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,S,S,0,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,C,C,1,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Q,Q,1,1

## Date functionality in pandas

In [60]:
import pandas as pd

# Creating a dictionary with your data
data = {
    'event_id': [101, 102, 103, 104, 105],
    'event_name': ['Product Launch', 'Quarterly Review', 'Team Building', 'Client Pitch', 'System Maintenance'],
    'date': ['2026-03-01', '2026-03-15', '2026-04-05', '2026-04-20', '2026-05-10'],
    'priority': ['High', 'Medium', 'Low', 'High', 'Critical']
}

In [61]:
# Initializing the DataFrame
df = pd.DataFrame(data)
df

   event_id          event_name        date  priority
0       101      Product Launch  2026-03-01      High
1       102    Quarterly Review  2026-03-15    Medium
2       103       Team Building  2026-04-05       Low
3       104        Client Pitch  2026-04-20      High
4       105  System Maintenance  2026-05-10  Critical

In [62]:
# Crucial step: Convert the 'date' column to datetime objects
df['date_pandas'] = pd.to_datetime(df['date'])
df

   event_id          event_name        date  priority date_pandas
0       101      Product Launch  2026-03-01      High  2026-03-01
1       102    Quarterly Review  2026-03-15    Medium  2026-03-15
2       103       Team Building  2026-04-05       Low  2026-04-05
3       104        Client Pitch  2026-04-20      High  2026-04-20
4       105  System Maintenance  2026-05-10  Critical  2026-05-10

In [63]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   event_id     5 non-null      int64
 1   event_name   5 non-null      str
 2   date         5 non-null      str
 3   priority     5 non-null      str
 4   date_pandas  5 non-null      datetime64[us]
dtypes: datetime64[us](1), int64(1), str(3)
memory usage: 332.0 bytes

In [64]:
print(df.dtypes)

event_id                int64
event_name                str
date                      str
priority                  str
date_pandas    datetime64[us]
dtype: object

In [65]:
df

   event_id          event_name        date  priority date_pandas
0       101      Product Launch  2026-03-01      High  2026-03-01
1       102    Quarterly Review  2026-03-15    Medium  2026-03-15
2       103       Team Building  2026-04-05       Low  2026-04-05
3       104        Client Pitch  2026-04-20      High  2026-04-20
4       105  System Maintenance  2026-05-10  Critical  2026-05-10

In [66]:
df["date_pandas"].dt.year

0    2026
1    2026
2    2026
3    2026
4    2026
Name: date_pandas, dtype: int32

In [67]:
df["date_pandas"].dt.month

0    3
1    3
2    4
3    4
4    5
Name: date_pandas, dtype: int32

In [70]:
df["date_pandas"].dt.day

0     1
1    15
2     5
3    20
4    10
Name: date_pandas, dtype: int32

In [68]:
df["date_pandas"].dt.day_name

In [69]:
df[df["date_pandas"] > '2026-03-15']

   event_id          event_name        date  priority date_pandas
2       103       Team Building  2026-04-05       Low  2026-04-05
3       104        Client Pitch  2026-04-20      High  2026-04-20
4       105  System Maintenance  2026-05-10  Critical  2026-05-10

In [71]:
df[df["date_pandas"].between ("2026-01-01", '2026-03-15')]

   event_id        event_name        date priority date_pandas
0       101    Product Launch  2026-03-01     High  2026-03-01
1       102  Quarterly Review  2026-03-15   Medium  2026-03-15

| Frequency Alias | Description |
| :--- | :--- |
| **D** | Calendar day |
| **B** | Business day (excludes weekends) |
| **W** | Weekly |
| **H** | Hourly |
| **ME** | Month End |
| **Q** | Quarter End |

In [72]:
pd.date_range(start='2026-01-01', end ="2026-02-27", freq= "D")

DatetimeIndex(['2026-01-01', '2026-01-02', '2026-01-03', '2026-01-04',
               '2026-01-05', '2026-01-06', '2026-01-07', '2026-01-08',
               '2026-01-09', '2026-01-10', '2026-01-11', '2026-01-12',
               '2026-01-13', '2026-01-14', '2026-01-15', '2026-01-16',
               '2026-01-17', '2026-01-18', '2026-01-19', '2026-01-20',
               '2026-01-21', '2026-01-22', '2026-01-23', '2026-01-24',
               '2026-01-25', '2026-01-26', '2026-01-27', '2026-01-28',
               '2026-01-29', '2026-01-30', '2026-01-31', '2026-02-01',
               '2026-02-02', '2026-02-03', '2026-02-04', '2026-02-05',
               '2026-02-06', '2026-02-07', '2026-02-08', '2026-02-09',
               '2026-02-10', '2026-02-11', '2026-02-12', '2026-02-13',
               '2026-02-14', '2026-02-15', '2026-02-16', '2026-02-17',
               '2026-02-18', '2026-02-19', '2026-02-20', '2026-02-21',
               '2026-02-22', '2026-02-23', '2026-02-24', '2026-02-25',
               '2026-02-26', '2026-02-27'],
              dtype='datetime64[us]', freq='D')

In [76]:
pd.date_range(start='2026-01-01', end ="2026-02-27", freq= "W")

DatetimeIndex(['2026-01-04', '2026-01-11', '2026-01-18', '2026-01-25',
               '2026-02-01', '2026-02-08', '2026-02-15', '2026-02-22'],
              dtype='datetime64[us]', freq='W-SUN')

In [77]:
pd.date_range(start='2026-01-01', end ="2026-02-27", freq= "ME")

DatetimeIndex(['2026-01-31'], dtype='datetime64[us]', freq='ME')

In [80]:
pd.date_range(start='2026-01-01', end ="2026-09-27", freq= "QE")

DatetimeIndex(['2026-03-31', '2026-06-30'], dtype='datetime64[us]', freq='QE-DEC')

#### Date ARITHMETICS

In [75]:
df["next_Week"] = df['date_pandas'] + pd.Timedelta(days=7)
df

   event_id          event_name        date  priority date_pandas  next_Week
0       101      Product Launch  2026-03-01      High  2026-03-01 2026-03-08
1       102    Quarterly Review  2026-03-15    Medium  2026-03-15 2026-03-22
2       103       Team Building  2026-04-05       Low  2026-04-05 2026-04-12
3       104        Client Pitch  2026-04-20      High  2026-04-20 2026-04-27
4       105  System Maintenance  2026-05-10  Critical  2026-05-10 2026-05-17

In [85]:
# Define today's date (Feb 28, 2026)
df["today"] =pd.to_datetime('2026-02-28')
df

,event_id,event_name,date,priority,date_pandas,next_Week,today
0,101,Product Launch,2026-03-01,High,2026-03-01,2026-03-08,2026-02-28
1,102,Quarterly Review,2026-03-15,Medium,2026-03-15,2026-03-22,2026-02-28
2,103,Team Building,2026-04-05,Low,2026-04-05,2026-04-12,2026-02-28
3,104,Client Pitch,2026-04-20,High,2026-04-20,2026-04-27,2026-02-28
4,105,System Maintenance,2026-05-10,Critical,2026-05-10,2026-05-17,2026-02-28

In [87]:
df['days_remaining'] = (df['date_pandas'] - df["today"]).dt.days
df

,event_id,event_name,date,priority,date_pandas,next_Week,today,days_remaining
0,101,Product Launch,2026-03-01,High,2026-03-01,2026-03-08,2026-02-28,1
1,102,Quarterly Review,2026-03-15,Medium,2026-03-15,2026-03-22,2026-02-28,15
2,103,Team Building,2026-04-05,Low,2026-04-05,2026-04-12,2026-02-28,36
3,104,Client Pitch,2026-04-20,High,2026-04-20,2026-04-27,2026-02-28,51
4,105,System Maintenance,2026-05-10,Critical,2026-05-10,2026-05-17,2026-02-28,71

## PANDAS COMPLETED

----==============================

# Git

##### save the file

In [88]:
import pandas as pd
import numpy as np